Repository: maksimts-kool/Programmeerimine
Catalog: Tund11.Auth/Resources/SharedResources.*.resx
Languages: et, ru

source: Home
et: Avaleht
ru: Главная

source: Privacy
et: Privaatsus
ru: Конфиденциальность

source: Welcome
et: Tere tulemast
ru: Добро пожаловать

source: Language
et: Keel
ru: Язык

source: Login
et: Logi sisse
ru: Войти

source: Register
et: Registreeri
ru: Регистрация

source: Logout
et: Logi välja
ru: Выйти

source: Email
et: E-post
ru: Эл. почта

source: Password
et: Parool
ru: Пароль

source: Remember me
et: Mäleta mind
ru: Запомнить меня

source: Confirm password
et: Kinnita parool
ru: Подтвердите пароль

# Identity_UseLocalAccountToLogin
source: Use a local account to log in.
et: Logi sisse kohaliku kontoga.
ru: Используйте локальную учетную запись для входа.

# Identity_ForgotPasswordLink
source: Forgot your password?
et: Unustasid parooli?
ru: Забыли пароль?

# Identity_RegisterAsNewUserLink
source: Register as a new user
et: Registreeru uue kasutajana
ru: Зарегистрироваться как новый пользователь

# Identity_ResendEmailConfirmationLink
source: Resend email confirmation
et: Saada e-posti kinnitus uuesti
ru: Повторно отправить подтверждение email

# Identity_UseAnotherServiceToLogin
source: Use another service to log in.
et: Logi sisse teise teenuse kaudu.
ru: Войти с помощью другого сервиса.

# Identity_NoExternalAuthConfiguredPrefix
source: There are no external authentication services configured. See this
et: Väliseid autentimisteenuseid pole seadistatud. Vaata seda
ru: Внешние службы аутентификации не настроены. См. эту

# Identity_NoExternalAuthConfiguredLinkText
source: article about setting up this ASP.NET application to support logging in via external services
et: artiklit selle ASP.NET rakenduse seadistamise kohta, et toetada sisselogimist väliste teenuste kaudu
ru: статью о настройке этого приложения ASP.NET для входа через внешние сервисы

# Identity_ExternalLoginButtonTitle
source: Log in using your {0} account
et: Logi sisse oma {0} kontoga
ru: Войти, используя вашу учетную запись {0}

# Identity_CreateNewAccount
source: Create a new account.
et: Loo uus konto.
ru: Создать новую учетную запись.

# Identity_UseAnotherServiceToRegister
source: Use another service to register.
et: Registreeru teise teenuse kaudu.
ru: Зарегистрироваться с помощью другого сервиса.

# Identity_ForgotPasswordTitle
source: Forgot your password?
et: Unustasid parooli?
ru: Забыли пароль?

# Identity_EnterYourEmail
source: Enter your email.
et: Sisesta oma e-posti aadress.
ru: Введите ваш email.

# Identity_ResetPasswordButton
source: Reset password
et: Lähtesta parool
ru: Сбросить пароль

# Identity_AccessDeniedTitle
source: Access denied
et: Ligipääs keelatud
ru: Доступ запрещён

# Identity_AccessDeniedMessage
source: You do not have access to this resource.
et: Teil ei ole sellele ressursile ligipääsu.
ru: У вас нет доступа к этому ресурсу.

# Identity_LockedOutTitle
source: Locked out
et: Konto lukustatud
ru: Аккаунт заблокирован

# Identity_LockedOutMessage
source: This account has been locked out, please try again later.
et: See konto on lukustatud. Palun proovige hiljem uuesti.
ru: Этот аккаунт заблокирован. Пожалуйста, попробуйте позже.

# Identity_LogoutTitle
source: Log out
et: Logi välja
ru: Выход

# Identity_ClickHereToLogout
source: Click here to log out
et: Vajuta siia, et välja logida
ru: Нажмите здесь, чтобы выйти

# Identity_LoggedOutSuccessfully
source: You have successfully logged out of the application.
et: Olete rakendusest edukalt välja loginud.
ru: Вы успешно вышли из приложения.

# Identity_ResetPasswordConfirmationTitle
source: Reset password confirmation
et: Parooli lähtestamise kinnitus
ru: Подтверждение сброса пароля

# Identity_PasswordHasBeenReset
source: Your password has been reset.
et: Teie parool on lähtestatud.
ru: Ваш пароль был сброшен.

# Identity_Please
source: Please
et: Palun
ru: Пожалуйста

# Identity_ClickHereToLogin
source: click here to log in
et: vajuta siia, et sisse logida
ru: нажмите здесь, чтобы войти

# Identity_ResendButton
source: Resend
et: Saada uuesti
ru: Отправить повторно

# Identity_ResetPasswordTitle
source: Reset password
et: Parooli lähtestamine
ru: Сброс пароля

# Identity_ResetYourPassword
source: Reset your password.
et: Lähtesta oma parool.
ru: Сбросьте пароль.

# Identity_PleaseEnterYourPassword
source: Please enter your password.
et: Palun sisesta parool.
ru: Введите пароль.

# Identity_PleaseConfirmYourPassword
source: Please confirm your password.
et: Palun kinnita parool.
ru: Подтвердите пароль.

# Identity_ResetButton
source: Reset
et: Lähtesta
ru: Сбросить

# Identity_ForgotPasswordConfirmationTitle
source: Forgot password confirmation
et: Parooli lähtestamise kinnitus
ru: Подтверждение сброса пароля

# Identity_CheckEmailToResetPassword
source: Please check your email to reset your password.
et: Parooli lähtestamiseks kontrolli oma e-posti.
ru: Проверьте свою почту, чтобы сбросить пароль.

# Identity_RegisterConfirmationTitle
source: Register confirmation
et: Registreerimise kinnitus
ru: Подтверждение регистрации

# Identity_NoRealEmailSenderPrefix
source: This app does not currently have a real email sender registered, see
et: Selles rakenduses ei ole praegu seadistatud päris e-kirja saatjat, vaata
ru: В этом приложении не настроен настоящий отправитель email, см.

# Identity_TheseDocsLinkText
source: these docs
et: neid juhiseid
ru: эти материалы

# Identity_NoRealEmailSenderSuffix
source: for how to configure a real email sender.
et: kuidas seadistada päris e-kirja saatja.
ru: чтобы настроить реального отправителя email.

# Identity_NormallyThisWouldBeEmailed
source: Normally this would be emailed:
et: Tavaliselt saadetaks see e-postiga:
ru: Обычно это отправляется по email:

# Identity_ClickHereToConfirmAccount
source: Click here to confirm your account
et: Vajuta siia, et kinnitada konto
ru: Нажмите здесь, чтобы подтвердить аккаунт

# Identity_CheckEmailToConfirmAccount
source: Please check your email to confirm your account.
et: Konto kinnitamiseks kontrolli oma e-posti.
ru: Проверьте свою почту, чтобы подтвердить аккаунт.

# Identity_ConfirmEmailTitle
source: Confirm email
et: Kinnita e-post
ru: Подтвердить email

# Identity_ManageYourAccount
source: Manage your account
et: Konto haldamine
ru: Управление аккаунтом

# Identity_ChangeAccountSettings
source: Change your account settings
et: Muuda konto seadeid
ru: Изменение настроек аккаунта

# Identity_Profile
source: Profile
et: Profiil
ru: Профиль

# Identity_ExternalLogins
source: External logins
et: Välised sisselogimised
ru: Внешние входы

# Identity_TwoFactorAuthentication
source: Two-factor authentication
et: Kahefaktoriline autentimine
ru: Двухфакторная аутентификация

# Identity_PersonalData
source: Personal data
et: Isikuandmed
ru: Личные данные

# Identity_ChangePasswordTitle
source: Change password
et: Muuda parooli
ru: Смена пароля

# Identity_PleaseEnterOldPassword
source: Please enter your old password.
et: Sisesta praegune parool.
ru: Введите текущий пароль.

# Identity_OldPassword
source: Old password
et: Praegune parool
ru: Текущий пароль

# Identity_PleaseEnterNewPassword
source: Please enter your new password.
et: Sisesta uus parool.
ru: Введите новый пароль.

# Identity_NewPassword
source: New password
et: Uus parool
ru: Новый пароль

# Identity_PleaseConfirmNewPassword
source: Please confirm your new password.
et: Kinnita uus parool.
ru: Подтвердите новый пароль.

# Identity_UpdatePasswordButton
source: Update password
et: Uuenda parooli
ru: Обновить пароль

# Identity_PleaseChooseUsername
source: Please choose your username.
et: Vali kasutajanimi.
ru: Выберите имя пользователя.

# Identity_Username
source: Username
et: Kasutajanimi
ru: Имя пользователя

# Identity_PleaseEnterPhoneNumber
source: Please enter your phone number.
et: Sisesta telefoninumber.
ru: Введите номер телефона.

# Identity_PhoneNumber
source: Phone number
et: Telefoninumber
ru: Номер телефона

source: Home Page
et: Koduleht
ru: Главная страница

source: Holidays
et: Pühad
ru: Праздники

source: Guests
et: Külalised
ru: Гости

source: Survey
et: Ankeet
ru: Анкета

source: Privacy Policy
et: Privaatsuspoliitika
ru: Политика конфиденциальности

source: Add Holiday
et: Lisa püha
ru: Добавить праздник

source: Add Guest
et: Lisa külaline
ru: Добавить гостя

source: Add Survey
et: Lisa ankeet
ru: Добавить анкету

source: Name
et: Nimi
ru: Имя

source: Date
et: Kuupäev
ru: Дата

source: Edit
et: Muuda
ru: Изменить

source: Details
et: Detailid
ru: Подробности

source: Delete
et: Kustuta
ru: Удалить

source: All
et: Kõik
ru: Все

source: Will Come
et: Tulevad
ru: Придут

source: Won't Come
et: Ei tule
ru: Не придут

source: Holiday
et: Püha
ru: Праздник

source: Event
et: Üritus
ru: Мероприятие

source: -- Select Event --
et: -- Vali üritus --
ru: -- Выберите мероприятие --

source: Who Attends
et: Kes osaleb
ru: Кто присутствует

# YesWillCome
source: Yes, I will definitely come
et: Jah, tulen kindlasti
ru: Да, я обязательно приду

# NoWontCome
source: No, unfortunately I can't come
et: Ei, kahjuks ei saa tulla
ru: Нет, к сожалению не смогу прийти

source: Save
et: Salvesta
ru: Сохранить

source: Back
et: Tagasi
ru: Назад

source: Title
et: Nimetus
ru: Название

source: Welcome to Pikook Laad!
et: Tere tulemast Pikook Laad!
ru: Добро пожаловать в Pikook Laad!

# HomeSubtitle
source: Manage events, guests and survey responses in one place
et: Haldage sündmusi, külalisi ja ankeetide vastuseid ühes kohas
ru: Управляйте событиями, гостями и ответами анкеты в одном месте

# HolidaysCardDescription
source: View and manage all upcoming events and holidays
et: Vaadake ja hallake kõiki eelseisvaid üritusi ja pühasid
ru: Просматривайте и управляйте всеми предстоящими событиями и праздниками

source: View holidays
et: Vaata pühasid
ru: Смотреть праздники

# SurveyCardDescription
source: Answer questions and register for events
et: Vastake küsimustele ja registreerige end üritustele
ru: Ответьте на вопросы и зарегистрируйтесь на мероприятия

# FillSurvey
source: Fill out the survey
et: Täida ankeet
ru: Заполнить анкету

# GuestsCardDescription
source: Manage guests and their participation in events
et: Hallake külalisi ja nende osalemist üritustel
ru: Управляйте гостями и их участием в мероприятиях

source: View guests
et: Vaata külalisi
ru: Смотреть гостей

# PrivacyCardDescription
source: Read our privacy policy and data protection
et: Lugege meie privaatsuspoliitikat ja andmekaitset
ru: Прочитайте нашу политику конфиденциальности и защиту данных

# HomeHowToStart
source: How to start?
et: Kuidas alustada?
ru: Как начать?

# StartViewHolidaysDesc
source: browse all upcoming events
et: tutvuge kõigi eelseisvate üritustega
ru: посмотрите все предстоящие события

# StartFillSurveyDesc
source: submit your answers and register
et: andke oma vastused ja registreerige end
ru: отправьте ответы и зарегистрируйтесь

source: Get confirmation
et: Saate kinnituse
ru: Получите подтверждение

# StartGetConfirmationDesc
source: you will receive an email confirming your registration
et: e-posti teel saate kinnituse oma registreerimise kohta
ru: вы получите письмо с подтверждением регистрации

# PrivacyPageText
source: Use this page to detail your site's privacy policy.
et: Kasutage seda lehte oma saidi privaatsuspoliitika kirjeldamiseks.
ru: На этой странице можно описать политику конфиденциальности вашего сайта.

# ThankYouTitle
source: Thank you!
et: Tänan!
ru: Спасибо!

# ThankYouForSurvey
source: Thank you for filling out the survey <strong>{0}</strong>!
et: Suur aitäh vastamise eest ankeetile <strong>{0}</strong>!
ru: Спасибо за заполнение анкеты <strong>{0}</strong>!

# ResponseSaved
source: Your response has been saved successfully.
et: Sinu vastus on edukalt salvestatud.
ru: Ваш ответ успешно сохранён.

# Congrats
source: Congratulations!
et: Õnnitleme!
ru: Поздравляем!

# HappyYouCome
source: Great that you're coming! See you at the event!
et: Väga tore, et tuled osalema! Näeme sind üritusel!
ru: Отлично, что вы придёте! Увидимся на мероприятии!

source: Sorry to hear!
et: Kahju kuulda!
ru: Очень жаль!

# SadYouCantCome
source: We're sad you can't come. Maybe next time!
et: Meil on kahju, et sa tulla ei saa. Võib-olla järgmine kord!
ru: Нам грустно, что вы не сможете прийти. Возможно, в следующий раз!

source: Survey details
et: Ankeedi detailid
ru: Детали анкеты

source: Survey name
et: Ankeedi nimi
ru: Название анкеты

source: Your answer
et: Sinu vastus
ru: Ваш ответ

# BackToHome
source: Back to home page
et: Tagasi kodulehele
ru: На главную

source: Edit guest
et: Muuda külalist
ru: Редактировать гостя

source: Guest details
et: Külalise detailid
ru: Детали гостя

source: Delete guest
et: Kustuta külaline
ru: Удалить гостя

# AreYouSureDelete
source: Are you sure you want to delete?
et: Kas oled kindel, et tahad kustutada?
ru: Вы уверены, что хотите удалить?

source: Participation
et: Osalemine
ru: Участие

source: -- Not set --
et: -- Pole määratud --
ru: -- Не задано --

source: No response
et: Pole vastanud
ru: Нет ответа

source: Cancel
et: Tühista
ru: Отмена

source: -- Select holiday --
et: -- Vali püha --
ru: -- Выберите праздник --

source: Edit holiday
et: Muuda püha
ru: Редактировать праздник

source: Holiday details
et: Püha detailid
ru: Детали праздника

source: Delete holiday
et: Kustuta püha
ru: Удалить праздник

# NoGuestsYet
source: There are no guests yet.
et: Hetkel külalisi pole.
ru: Гостей пока нет.

source: Manage
et: Halda
ru: Управление

# HelloUser
source: Hello {0}!
et: Tere, {0}!
ru: Привет, {0}!

source: Download
et: Laadi alla
ru: Скачать

source: Remove
et: Eemalda
ru: Удалить

# Identity_LoginWith2fa_Title
source: Two-factor authentication
et: Kahefaktoriline autentimine
ru: Двухфакторная аутентификация

# Identity_LoginWith2fa_Description
source: Your login is protected with an authenticator app. Enter your authenticator code below.
et: Sinu sisselogimine on kaitstud autentimisrakendusega. Sisesta allpool autentimiskood.
ru: Ваш вход защищён приложением-аутентификатором. Введите код аутентификатора ниже.

# Identity_LoginWith2fa_NoAccessToDevice
source: Don't have access to your authenticator device? You can
et: Pole ligipääsu oma autentimisseadmele? Sa saad
ru: Нет доступа к устройству с аутентификатором? Вы можете

# Identity_LoginWith2fa_LoginWithRecoveryCodeLink
source: log in with a recovery code
et: sisse logida taastamiskoodiga
ru: войти с помощью кода восстановления

# Identity_LoginWithRecoveryCode_Title
source: Recovery code verification
et: Taastamiskoodi kinnitamine
ru: Проверка кода восстановления

# Identity_LoginWithRecoveryCode_Description
source: You have requested to log in with a recovery code. This login will not be remembered until you provide an authenticator app code at log in or disable 2FA and log in again.
et: Soovisid sisse logida taastamiskoodiga. Seda sisselogimist ei jäeta meelde enne, kui sisestad sisselogimisel autentimisrakenduse koodi või keelad 2FA ja logid uuesti sisse.
ru: Вы запросили вход с помощью кода восстановления. Этот вход не будет запомнен, пока вы не введёте код из приложения-аутентификатора при входе или не отключите 2FA и не войдёте снова.

# Identity_RecoveryCodePlaceholder
source: Recovery code
et: Taastamiskood
ru: Код восстановления

# Identity_ExternalProvider
source: External provider
et: Väline teenusepakkuja
ru: Внешний провайдер

# Identity_ExternalLogin_AssociateTitle
source: Associate your {0} account.
et: Seosta oma {0} konto.
ru: Связать аккаунт {0}.

# Identity_ExternalLogin_SuccessfullyAuthenticatedWith
source: You've successfully authenticated with
et: Oled edukalt autentitud teenusega
ru: Вы успешно вошли через

# Identity_ExternalLogin_PleaseEnterEmailToFinish
source: Please enter an email address for this site below and click the Register button to finish logging in.
et: Palun sisesta allpool selle saidi e-posti aadress ja klõpsa nuppu „Registreeru”, et sisselogimine lõpetada.
ru: Пожалуйста, введите адрес электронной почты для этого сайта ниже и нажмите кнопку «Регистрация», чтобы завершить вход.

# Identity_EmailPlaceholder
source: Please enter your email.
et: Palun sisesta oma e-post.
ru: Введите вашу электронную почту.

# Identity_ConfirmEmailChange_Title
source: Confirm email change
et: Kinnita e-posti muutmine
ru: Подтвердить смену электронной почты

# Identity_ManageTwoFactor_Title
source: Two-factor authentication (2FA)
et: Kahefaktoriline autentimine (2FA)
ru: Двухфакторная аутентификация (2FA)

# Identity_ManageTwoFactor_NoRecoveryCodesLeft
source: You have no recovery codes left.
et: Sul pole enam taastamiskoode.
ru: У вас не осталось кодов восстановления.

# Identity_ManageTwoFactor_MustGenerateNewRecoveryCodesPrefix
source: You must
et: Sa pead
ru: Вам нужно

# Identity_ManageTwoFactor_GenerateNewRecoveryCodesLink
source: generate a new set of recovery codes
et: genereerima uue taastamiskoodide komplekti
ru: сгенерировать новый набор кодов восстановления

# Identity_ManageTwoFactor_MustGenerateNewRecoveryCodesSuffix
source: before you can log in with a recovery code.
et: enne kui saad taastamiskoodiga sisse logida.
ru: прежде чем вы сможете войти с кодом восстановления.

# Identity_ManageTwoFactor_OneRecoveryCodeLeft
source: You have 1 recovery code left.
et: Sul on jäänud 1 taastamiskood.
ru: У вас остался 1 код восстановления.

# Identity_ManageTwoFactor_YouCanPrefix
source: You can
et: Sa saad
ru: Вы можете

# Identity_ManageTwoFactor_RecoveryCodesLeft
source: You have {0} recovery codes left.
et: Sul on jäänud {0} taastamiskoodi.
ru: У вас осталось кодов восстановления: {0}.

# Identity_ManageTwoFactor_YouShouldPrefix
source: You should
et: Sa peaksid
ru: Вам следует

# Identity_ManageTwoFactor_ForgetThisBrowser
source: Forget this browser
et: Unusta see brauser
ru: Забыть этот браузер

# Identity_ManageTwoFactor_Disable2FA
source: Disable 2FA
et: Keela 2FA
ru: Отключить 2FA

# Identity_ManageTwoFactor_ResetRecoveryCodes
source: Reset recovery codes
et: Lähtesta taastamiskoodid
ru: Сбросить коды восстановления

# Identity_ManageTwoFactor_AuthenticatorApp
source: Authenticator app
et: Autentimisrakendus
ru: Приложение-аутентификатор

# Identity_ManageTwoFactor_AddAuthenticatorApp
source: Add authenticator app
et: Lisa autentimisrakendus
ru: Добавить приложение-аутентификатор

# Identity_ManageTwoFactor_SetUpAuthenticatorApp
source: Set up authenticator app
et: Seadista autentimisrakendus
ru: Настроить приложение-аутентификатор

# Identity_ManageTwoFactor_ResetAuthenticatorApp
source: Reset authenticator app
et: Lähtesta autentimisrakendus
ru: Сбросить приложение-аутентификатор

# Identity_ManageTwoFactor_PrivacyPolicyNotAccepted
source: Privacy and cookie policy have not been accepted.
et: Privaatsus- ja küpsiste poliitikat pole vastu võetud.
ru: Политика конфиденциальности и cookies не принята.

# Identity_ManageTwoFactor_AcceptPolicyToEnable2FA
source: You must accept the policy before you can enable two factor authentication.
et: Kahefaktorilise autentimise lubamiseks pead poliitika vastu võtma.
ru: Чтобы включить двухфакторную аутентификацию, необходимо принять политику.

# Identity_EnableAuthenticator_Title
source: Configure authenticator app
et: Seadista autentimisrakendus
ru: Настроить приложение-аутентификатор

# Identity_EnableAuthenticator_Intro
source: To use an authenticator app go through the following steps:
et: Autentimisrakenduse kasutamiseks tee järgmised sammud:
ru: Чтобы использовать приложение-аутентификатор, выполните следующие шаги:

# Identity_EnableAuthenticator_DownloadAppPrefix
source: Download a two-factor authenticator app like
et: Laadi alla kahefaktoriline autentimisrakendus, näiteks
ru: Скачайте приложение-аутентификатор (2FA), например

# Identity_EnableAuthenticator_DownloadAppFor
source: for
et: jaoks
ru: для

# Identity_EnableAuthenticator_ScanQrPrefix
source: Scan the QR Code or enter this key
et: Skanni QR-kood või sisesta see võti
ru: Отсканируйте QR-код или введите этот ключ

# Identity_EnableAuthenticator_ScanQrSuffix
source: into your two factor authenticator app. Spaces and casing do not matter.
et: oma autentimisrakendusse. Tühikud ja suur-/väiketähed ei oma tähtsust.
ru: в своё приложение-аутентификатор. Пробелы и регистр не имеют значения.

# Identity_EnableAuthenticator_LearnHowPrefix
source: Learn how to
et: Uuri, kuidas
ru: Узнайте, как

# Identity_EnableAuthenticator_EnableQrCodeGenerationLink
source: enable QR code generation
et: lubada QR-koodi genereerimine
ru: включить генерацию QR-кода

# Identity_EnableAuthenticator_AfterScan
source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
et: Kui oled QR-koodi skanninud või ülaloleva võtme sisestanud, annab autentimisrakendus sulle unikaalse koodi. Sisesta kood allolevasse kinnituskasti.
ru: После сканирования QR-кода или ввода ключа выше ваше приложение-аутентификатор предоставит уникальный код. Введите код в поле подтверждения ниже.

# Identity_VerificationCodePlaceholder
source: Please enter the code.
et: Palun sisesta kood.
ru: Введите код.

# Identity_VerificationCode
source: Verification Code
et: Kinnituskood
ru: Код подтверждения

# Identity_Verify
source: Verify
et: Kinnita
ru: Подтвердить

# Identity_ManageEmail_Title
source: Manage Email
et: Halda e-posti
ru: Управление электронной почтой

# Identity_ManageEmail_SendVerificationEmail
source: Send verification email
et: Saada kinnituskiri
ru: Отправить письмо для подтверждения

# Identity_ManageEmail_NewEmailPlaceholder
source: Please enter new email.
et: Palun sisesta uus e-post.
ru: Введите новый адрес электронной почты.

# Identity_ManageEmail_ChangeEmail
source: Change email
et: Muuda e-posti
ru: Сменить электронную почту

# Identity_ManageExternalLogins_Title
source: Manage your external logins
et: Halda väliseid sisselogimisi
ru: Управление внешними входами

# Identity_ManageExternalLogins_RegisteredLogins
source: Registered Logins
et: Registreeritud sisselogimised
ru: Подключённые входы

# Identity_ManageExternalLogins_RemoveLoginTitle
source: Remove this {0} login from your account
et: Eemalda {0} sisselogimine sinu kontolt
ru: Удалить вход {0} из вашей учётной записи

# Identity_ManageExternalLogins_AddAnotherService
source: Add another service to log in.
et: Lisa teine teenus sisselogimiseks.
ru: Добавить другой сервис для входа.

# Identity_ManageExternalLogins_LinkLoginTitle
source: Log in using your {0} account
et: Logi sisse oma {0} kontoga
ru: Войти с помощью аккаунта {0}

# Identity_Disable2fa_Title
source: Disable two-factor authentication (2FA)
et: Keela kahefaktoriline autentimine (2FA)
ru: Отключить двухфакторную аутентификацию (2FA)

# Identity_Disable2fa_AlertStrong
source: This action only disables 2FA.
et: See tegevus keelab ainult 2FA.
ru: Это действие только отключает 2FA.

# Identity_Disable2fa_DescriptionPrefix
source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
et: 2FA keelamine ei muuda autentimisrakendustes kasutatavaid võtmeid. Kui soovid autentimisrakenduses kasutatavat võtit muuta, peaksid
ru: Отключение 2FA не меняет ключи, используемые в приложениях-аутентификаторах. Если вы хотите изменить ключ, используемый в приложении-аутентификаторе, вам следует

# Identity_Disable2fa_ResetAuthenticatorKeysLink
source: reset your authenticator keys.
et: lähtestama oma autentimisvõtmed.
ru: сбросить ключи аутентификатора.

# Identity_Disable2fa_Button
source: Disable 2FA
et: Keela 2FA
ru: Отключить 2FA

# Identity_GenerateRecoveryCodes_Title
source: Generate two-factor authentication (2FA) recovery codes
et: Genereeri kahefaktorilise autentimise (2FA) taastamiskoodid
ru: Сгенерировать коды восстановления для двухфакторной аутентификации (2FA)
