Repository: maksimts-kool/Programmeerimine
Catalog: Tund11.Auth/Resources/SharedResources.*.resx
Languages: et, ru

# Identity_RecoveryCodes_PutInSafePlace
source: Put these codes in a safe place.
et: Hoia neid koode turvalises kohas.
ru: Храните эти коды в безопасном месте.

# Identity_RecoveryCodes_LoseAccessWarning
source: If you lose your device and don't have the recovery codes you will lose access to your account.
et: Kui kaotad seadme ja sul pole taastamiskoode, kaotad ligipääsu oma kontole.
ru: Если вы потеряете устройство и у вас не будет кодов восстановления, вы потеряете доступ к своей учётной записи.

# Identity_GenerateRecoveryCodes_DescriptionPrefix
source: Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
et: Uute taastamiskoodide genereerimine ei muuda autentimisrakendustes kasutatavaid võtmeid. Kui soovid autentimisrakenduses kasutatavat võtit muuta, peaksid
ru: Генерация новых кодов восстановления не меняет ключи, используемые в приложениях-аутентификаторах. Если вы хотите изменить ключ, используемый в приложении-аутентификаторе, вам следует

# Identity_GenerateRecoveryCodes_ResetAuthenticatorKeysLink
source: reset your authenticator keys.
et: lähtestama oma autentimisvõtmed.
ru: сбросить ключи аутентификатора.

# Identity_GenerateRecoveryCodes_Button
source: Generate Recovery Codes
et: Genereeri taastamiskoodid
ru: Сгенерировать коды восстановления

# Identity_ResetAuthenticator_Title
source: Reset authenticator key
et: Lähtesta autentimisvõti
ru: Сбросить ключ аутентификатора

# Identity_ResetAuthenticator_WarningStrong
source: If you reset your authenticator key your authenticator app will not work until you reconfigure it.
et: Kui lähtestad autentimisvõtme, ei tööta autentimisrakendus enne, kui seadistad selle uuesti.
ru: Если вы сбросите ключ аутентификатора, приложение-аутентификатор не будет работать, пока вы не настроите его заново.

# Identity_ResetAuthenticator_Description
source: This process disables 2FA until you verify your authenticator app. If you do not complete your authenticator app configuration you may lose access to your account.
et: See protsess keelab 2FA kuni kinnitad autentimisrakenduse. Kui sa seadistamist ei lõpeta, võid kaotada ligipääsu oma kontole.
ru: Этот процесс отключает 2FA до тех пор, пока вы не подтвердите приложение-аутентификатор. Если вы не завершите настройку, вы можете потерять доступ к своей учётной записи.

# Identity_ResetAuthenticator_Button
source: Reset authenticator key
et: Lähtesta autentimisvõti
ru: Сбросить ключ аутентификатора

# Identity_ShowRecoveryCodes_Title
source: Recovery codes
et: Taastamiskoodid
ru: Коды восстановления

# Identity_PersonalData_Title
source: Personal Data
et: Isikuandmed
ru: Личные данные

# Identity_PersonalData_Description
source: Your account contains personal data that you have given us. This page allows you to download or delete that data.
et: Sinu konto sisaldab isikuandmeid, mille oled meile andnud. Sellelt lehelt saad need andmed alla laadida või kustutada.
ru: В вашей учётной записи содержатся личные данные, которые вы нам предоставили. На этой странице вы можете скачать или удалить эти данные.

# Identity_PersonalData_DeletePermanentWarning
source: Deleting this data will permanently remove your account, and this cannot be recovered.
et: Nende andmete kustutamine eemaldab sinu konto jäädavalt ning seda ei saa taastada.
ru: Удаление этих данных навсегда удалит вашу учётную запись, и восстановить её будет невозможно.

# Identity_DeletePersonalData_Title
source: Delete Personal Data
et: Kustuta isikuandmed
ru: Удалить личные данные

# Identity_PasswordPlaceholder
source: Please enter your password.
et: Palun sisesta oma parool.
ru: Введите ваш пароль.

# Identity_DeletePersonalData_Button
source: Delete data and close my account
et: Kustuta andmed ja sulge minu konto
ru: Удалить данные и закрыть учётную запись

# Identity_DownloadPersonalData_Title
source: Download Your Data
et: Laadi alla oma andmed
ru: Скачать ваши данные

# Identity_SetPassword_Title
source: Set password
et: Määra parool
ru: Установить пароль

# Identity_SetPassword_Heading
source: Set your password
et: Määra oma parool
ru: Установить пароль

# Identity_SetPassword_Info
source: You do not have a local username/password for this site. Add a local account so you can log in without an external login.
et: Sul pole selle saidi jaoks kohalikku kasutajanime/parooli. Lisa kohalik konto, et saaksid sisse logida ilma välise sisselogimiseta.
ru: У вас нет локального имени пользователя/пароля для этого сайта. Добавьте локальную учётную запись, чтобы входить без внешнего входа.

# Identity_NewPasswordPlaceholder
source: Please enter your new password.
et: Palun sisesta uus parool.
ru: Введите новый пароль.

# Identity_ConfirmPasswordPlaceholder
source: Please confirm your new password.
et: Palun kinnita uus parool.
ru: Подтвердите новый пароль.

# Identity_SetPassword_Button
source: Set password
et: Määra parool
ru: Установить пароль

source: Created date
et: Loomise kuupäev
ru: Дата создания

# Error_AddHolidayFirst
source: Before adding a guest, add at least one holiday.
et: Enne külalise lisamist lisa vähemalt üks püha.
ru: Перед добавлением гостя добавьте хотя бы один праздник.

# Validation_SelectHoliday
source: Select a holiday.
et: Vali püha.
ru: Выберите праздник.

# Validation_SelectEvent
source: Select an event.
et: Vali üritus.
ru: Выберите мероприятие.

# Validation_EmailDomainInvalid
source: Email is invalid or domain does not exist.
et: E-post ei ole korrektne või domeen ei eksisteeri.
ru: Электронная почта некорректна или домен не существует.

source: The {0} field is required.
et: Väli {0} on kohustuslik.
ru: Поле «{0}» обязательно.

source: The field {0} must be a string with a maximum length of {1}.
et: Väli {0} võib sisaldada maksimaalselt {1} märki.
ru: Поле «{0}» должно содержать не более {1} символов.

source: The {0} field is not a valid e-mail address.
et: Väli {0} ei ole korrektne e-posti aadress.
ru: Поле «{0}» не является корректным адресом электронной почты.
